Tekla Open API Reference for Tekla Structures 2025
Edge Properties
The Edge type exposes the following members.
Properties
Name | Description
EndPoint
 Gets the end point of the edge.
StartPoint
 Gets the start point of the edge.
Type
 Gets the type of the edge.
Top
See Also
Reference
Edge Class
Tekla.Structures.Solid Namespace